Revit 2017 API
ExternalResourceUtils Class
 A utility class containing functions related to external resource references.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public static class ExternalResourceUtils
Visual Basic
Public NotInheritable Class ExternalResourceUtils
Visual C++
public ref class ExternalResourceUtils abstract sealed
Remarks
 Elements which are external resource references refer to data outside of the base .rvt file.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalResourceUtils
See Also
ExternalResourceUtils Members
Autodesk.Revit.DB Namespace